#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️``
#### Terraform Validation 🤖Success! The configuration is valid.


#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform
Acquiring state lock. This may take a few moments...
data.azuread_application.mySlackBotApp2: Reading...
azuread_directory_role.user_admin: Refreshing state... [id=45e72cc6-0b68-45eb-b44d-55398659d32b]
azuread_directory_role.UserAdministrator: Refreshing state... [id=45e72cc6-0b68-45eb-b44d-55398659d32b]
data.azuread_application.mySlackBotApp2: Read complete after 2s [id=7c710e62-feda-4c75-b2bf-11fba302c170]
data.azuread_service_principal.mySlackBotApp2: Reading...
data.azuread_service_principal.mySlackBotApp2: Read complete after 1s [id=1285aa99-59b2-4eeb-a299-c5e56445cfe1]
azurerm_service_plan.serviceplan: Refreshing state... [id=/subscriptions/12d86072-036c-4cde-9b65-5d7560165386/resourceGroups/langchain-experiments/providers/Microsoft.Web/serverfarms/serviceplan]
azurerm_resource_group.LangChain-Experiments: Refreshing state... [id=/subscriptions/12d86072-036c-4cde-9b65-5d7560165386/resourceGroups/LangChain-Experiments]
data.azurerm_client_config.current: Reading...
data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD1kNmY5YzUwOS04YWFkLTQ4MjctYWY4ZS0yYzc2ZWFmNzEwYWE7b2JqZWN0SWQ9MTI4NWFhOTktNTliMi00ZWViLWEyOTktYzVlNTY0NDVjZmUxO3N1YnNjcmlwdGlvbklkPTEyZDg2MDcyLTAzNmMtNGNkZS05YjY1LTVkNzU2MDE2NTM4Njt0ZW5hbnRJZD01NDY5ZDEzNy0zNDlmLTQwNjAtYjgwNy1mZWYzYjQ5MjgxMmI=]
azuread_directory_role_member.slackbot_user_admin: Refreshing state... [id=45e72cc6-0b68-45eb-b44d-55398659d32b/member/948bddda-2615-40bb-98b8-2554b364b54a]
azurerm_key_vault.slackbot_secrets: Refreshing state... [id=/subscriptions/12d86072-036c-4cde-9b65-5d7560165386/resourceGroups/LangChain-Experiments/providers/Microsoft.KeyVault/vaults/slackbot-secrets]
azurerm_redis_cache.bot-cache: Refreshing state... [id=/subscriptions/12d86072-036c-4cde-9b65-5d7560165386/resourceGroups/LangChain-Experiments/providers/Microsoft.Cache/redis/LangChain-Experiments]
azurerm_storage_account.gnwosutfstatestorageacc: Refreshing state... [id=/subscriptions/12d86072-036c-4cde-9b65-5d7560165386/resourceGroups/LangChain-Experiments/providers/Microsoft.Storage/storageAccounts/gnwosutfstatestorageacc]
azurerm_cognitive_account.LangChain_Experiments: Refreshing state... [id=/subscriptions/12d86072-036c-4cde-9b65-5d7560165386/resourceGroups/LangChain-Experiments/providers/Microsoft.CognitiveServices/accounts/LangChain-Experiments]
azurerm_linux_web_app.slackbotwebapp: Refreshing state... [id=/subscriptions/12d86072-036c-4cde-9b65-5d7560165386/resourceGroups/LangChain-Experiments/providers/Microsoft.Web/sites/slackbotwebapp]
azurerm_key_vault_secret.slackbot_azure_cogservices_key: Refreshing state... [id=https://slackbot-secrets.vault.azure.net/secrets/cogservices-key/b4f4afff66594b2db7555e1300f92d95]
azurerm_key_vault_secret.slackbot_synth_endpoint: Refreshing state... [id=https://slackbot-secrets.vault.azure.net/secrets/slackbot-synth-endpoint/2452d172c1e2463bac31c9d173be3e68]
azurerm_key_vault_secret.slackbot_synth_primary_access_key: Refreshing state... [id=https://slackbot-secrets.vault.azure.net/secrets/slackbot-synth-primary-access-key/e773f33f5992439580f3778c37256365]
azurerm_key_vault_access_policy.slackbot_app: Refreshing state... [id=/subscriptions/12d86072-036c-4cde-9b65-5d7560165386/resourceGroups/LangChain-Experiments/providers/Microsoft.KeyVault/vaults/slackbot-secrets/objectId/948bddda-2615-40bb-98b8-2554b364b54a]
azurerm_key_vault_secret.slackbot_redis_hostname: Refreshing state... [id=https://slackbot-secrets.vault.azure.net/secrets/redis-key/66eea9e8312847ce97485a439711f7f0]
azurerm_key_vault_secret.slackbot_redis_key: Refreshing state... [id=https://slackbot-secrets.vault.azure.net/secrets/redis-key/0e4161ca3d52430bafef7d7e941eac12]
azurerm_storage_container.gnwosutfstatestoragecont: Refreshing state... [id=https://gnwosutfstatestorageacc.blob.core.windows.net/gnwosutfstatestoragecont]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # data.azuread_user.greg_data will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azuread_user" "greg_data" {
      + account_enabled                = (known after apply)
      + age_group                      = (known after apply)
      + business_phones                = (known after apply)
      + city                           = (known after apply)
      + company_name                   = (known after apply)
      + consent_provided_for_minor     = (known after apply)
      + cost_center                    = (known after apply)
      + country                        = (known after apply)
      + creation_type                  = (known after apply)
      + department                     = (known after apply)
      + display_name                   = (known after apply)
      + division                       = (known after apply)
      + employee_id                    = (known after apply)
      + employee_type                  = (known after apply)
      + external_user_state            = (known after apply)
      + fax_number                     = (known after apply)
      + given_name                     = (known after apply)
      + id                             = (known after apply)
      + im_addresses                   = (known after apply)
      + job_title                      = (known after apply)
      + mail                           = (known after apply)
      + mail_nickname                  = (known after apply)
      + manager_id                     = (known after apply)
      + mobile_phone                   = (known after apply)
      + object_id                      = (known after apply)
      + office_location                = (known after apply)
      + onpremises_distinguished_name  = (known after apply)
      + onpremises_domain_name         = (known after apply)
      + onpremises_immutable_id        = (known after apply)
      + onpremises_sam_account_name    = (known after apply)
      + onpremises_security_identifier = (known after apply)
      + onpremises_sync_enabled        = (known after apply)
      + onpremises_user_principal_name = (known after apply)
      + other_mails                    = (known after apply)
      + postal_code                    = (known after apply)
      + preferred_language             = (known after apply)
      + proxy_addresses                = (known after apply)
      + show_in_address_list           = (known after apply)
      + state                          = (known after apply)
      + street_address                 = (known after apply)
      + surname                        = (known after apply)
      + usage_location                 = (known after apply)
      + user_principal_name            = "greg.nwosu_gmail.com#EXT#@gregnwosugmail.onmicrosoft.com"
      + user_type                      = (known after apply)
    }

  # azuread_directory_role_member.slackbot_user_admin must be replaced
-/+ resource "azuread_directory_role_member" "slackbot_user_admin" {
      ~ id               = "45e72cc6-0b68-45eb-b44d-55398659d32b/member/948bddda-2615-40bb-98b8-2554b364b54a" -> (known after apply)
      ~ member_object_id = "948bddda-2615-40bb-98b8-2554b364b54a" -> "1285aa99-59b2-4eeb-a299-c5e56445cfe1" # forces replacement
        # (1 unchanged attribute hidden)
    }

  # azurerm_key_vault.slackbot_secrets will be updated in-place
  ~ resource "azurerm_key_vault" "slackbot_secrets" {
      - enable_rbac_authorization       = true -> null
        id                              = "/subscriptions/12d86072-036c-4cde-9b65-5d7560165386/resourceGroups/LangChain-Experiments/providers/Microsoft.KeyVault/vaults/slackbot-secrets"
        name                            = "slackbot-secrets"
        tags                            = {}
        # (12 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # azurerm_key_vault_access_policy.slackbot_app must be replaced
-/+ resource "azurerm_key_vault_access_policy" "slackbot_app" {
      - certificate_permissions = [] -> null
      ~ id                      = "/subscriptions/12d86072-036c-4cde-9b65-5d7560165386/resourceGroups/LangChain-Experiments/providers/Microsoft.KeyVault/vaults/slackbot-secrets/objectId/948bddda-2615-40bb-98b8-2554b364b54a" -> (known after apply)
      ~ key_permissions         = [
            # (1 unchanged element hidden)
            "List",
          - "Encrypt",
          - "Decrypt",
        ]
      ~ object_id               = "948bddda-2615-40bb-98b8-2554b364b54a" -> "1285aa99-59b2-4eeb-a299-c5e56445cfe1" # forces replacement
      ~ secret_permissions      = [
          - "Get",
            "List",
          + "Get",
            "Set",
          + "Delete",
          + "Recover",
          + "Backup",
          + "Restore",
        ]
      - storage_permissions     = [] -> null
        # (2 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.slackbot_redis_key will be updated in-place
  ~ resource "azurerm_key_vault_secret" "slackbot_redis_key" {
        id                      = "https://slackbot-secrets.vault.azure.net/secrets/redis-key/0e4161ca3d52430bafef7d7e941eac12"
        name                    = "redis-key"
        tags                    = {}
      ~ value                   = (sensitive value)
        # (5 unchanged attributes hidden)
    }

  # azurerm_linux_web_app.slackbotwebapp will be updated in-place
  ~ resource "azurerm_linux_web_app" "slackbotwebapp" {
        id                                = "/subscriptions/12d86072-036c-4cde-9b65-5d7560165386/resourceGroups/LangChain-Experiments/providers/Microsoft.Web/sites/slackbotwebapp"
        name                              = "slackbotwebapp"
      ~ service_plan_id                   = "/subscriptions/12d86072-036c-4cde-9b65-5d7560165386/resourceGroups/LangChain-Experiments/providers/Microsoft.Web/serverfarms/serviceplan" -> "/subscriptions/12d86072-036c-4cde-9b65-5d7560165386/resourceGroups/langchain-experiments/providers/Microsoft.Web/serverfarms/serviceplan"
        tags                              = {}
        # (17 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

Plan: 2 to add, 3 to change, 2 to destroy.

Warning: Deprecated Resource

  with azuread_directory_role_member.slackbot_user_admin,
  on keyvault.tf line 39, in resource "azuread_directory_role_member" "slackbot_user_admin":
  39: resource "azuread_directory_role_member" "slackbot_user_admin" {

This resource is deprecated and will be removed in version 3.0 of the AzureAD
provider. Please use the `azuread_directory_role_assignment` resource
instead.

(and one more similar warning elsewhere)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
Releasing state lock. This may take a few moments...
```

</details>

*Pusher: @gregnwosu, Action: `pull_request`, Working Directory: ``, Workflow: `Build and deploy Python app to Azure Web App - slackbotwebapp`*